# DBeam_EndShttGet

## Description
End creating 3D shutter object.

```pascal
PROCEDURE DBeam_EndShttGet(bUseLampRotFlag : BOOLEAN);
```

```python
def vs.DBeam_EndShttGet(bUseLampRotFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bUseLampRotFlag|BOOLEAN|   |

## Examples
```pascal
DBeam_EndShttGet(TRUE);
```
```python
import vs

# End creating 3D shutter object.
bUseLampRotFlag = True

vs.DBeam_EndShttGet(bUseLampRotFlag)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight